taskt/Core/Automation/Commands/WindowGroup/IWindowSizeProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IWindowSizeProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.GetWindowSizesFromWindowNamesAsListCommand" [ label="GetWindowSizesFromWindowNamesAsListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.IWindowSizeProperties" [ label="IWindowSizeProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ResizeWindowsCommand" [ label="ResizeWindowsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ResizeOneWindowCommand" [ label="ResizeOneWindowCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetOneWindowSizeCommand" [ label="GetOneWindowSizeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.IWindowResizeProperties" [ label="IWindowResizeProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.GetWindowSizeFromWindowHandleCommand" [ label="GetWindowSizeFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ResizeWindowByWindowHandleCommand" [ label="ResizeWindowByWindowHandleCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.GetWindowSizesFromWindowNamesAsListCommand" -> "taskt.Core.Automation.Commands.IWindowSizeProperties";
"taskt.Core.Automation.Commands.ResizeWindowsCommand" -> "taskt.Core.Automation.Commands.IWindowSizeProperties";
"taskt.Core.Automation.Commands.ResizeOneWindowCommand" -> "taskt.Core.Automation.Commands.IWindowSizeProperties";
"taskt.Core.Automation.Commands.GetOneWindowSizeCommand" -> "taskt.Core.Automation.Commands.IWindowSizeProperties";
"taskt.Core.Automation.Commands.IWindowResizeProperties" -> "taskt.Core.Automation.Commands.IWindowSizeProperties";
"taskt.Core.Automation.Commands.GetWindowSizeFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.IWindowSizeProperties";
"taskt.Core.Automation.Commands.ResizeWindowByWindowHandleCommand" -> "taskt.Core.Automation.Commands.IWindowResizeProperties";
}
